test/nexj/core/persistence/sql/data/readGroupByCase.xml

<nv:Envelope xmlns:nv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema">
   <nv:Body xmlns:ns="http://www.nexjsystems.com/xml-soap" nv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <ns:Array>
         <items nc:arrayType="xs:anyType[5]">
            <Item href="#a"/>
            <Item href="#b"/>
            <Item href="#c"/>
            <Item href="#d"/>
            <Item href="#e"/>
         </items>
      </ns:Array>
      <ns:TransferObject id="a">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[2]">
            <Item>c</Item>
            <Item>firstName</Item>
         </keys>
         <values nc:arrayType="xs:anyType[2]">
            <Item xi:type="xs:long">1</Item>
            <Item xi:type="xs:string">Gaius</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="b">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[2]">
            <Item>c</Item>
            <Item>firstName</Item>
         </keys>
         <values nc:arrayType="xs:anyType[2]">
            <Item xi:type="xs:long">1</Item>
            <Item xi:type="xs:string">Gnaeus</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="c">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[2]">
            <Item>c</Item>
            <Item>firstName</Item>
         </keys>
         <values nc:arrayType="xs:anyType[2]">
            <Item xi:type="xs:long">1</Item>
            <Item xi:type="xs:string">Joe</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="d">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[2]">
            <Item>c</Item>
            <Item>firstName</Item>
         </keys>
         <values nc:arrayType="xs:anyType[2]">
            <Item xi:type="xs:long">1</Item>
            <Item xi:type="xs:string">John</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="e">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[2]">
            <Item>c</Item>
            <Item>firstName</Item>
         </keys>
         <values nc:arrayType="xs:anyType[2]">
            <Item xi:type="xs:long">1</Item>
            <Item xi:type="xs:string">Zoe</Item>
         </values>
      </ns:TransferObject>
   </nv:Body>
</nv:Envelope>
